tutorials/incompressible/simpleSolver/ACCM_airFoil2D/constant/polyMesh/boundary
/*---------------------------------------------------------------------------*\
Caelus 7.04
 Web:      www.caelus-cml.com 
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          896;
        startFace       457792;
    }
    left
    {
        type            empty;
        nFaces          229376;
        startFace       458688;
    }
    outlet
    {
        type            patch;
        nFaces          512;
        startFace       688064;
    }
    right
    {
        type            empty;
        nFaces          229376;
        startFace       688576;
    }
    wall
    {
        type            wall;
        nFaces          512;
        startFace       917952;
    }
)

// ************************************************************************* //
