tutorials/incompressible/simpleSolver/ACCM_airFoil2D/system/decomposeParDict
/*-------------------------------------------------------------------------------*
Caelus 7.04
Web:   www.caelus-cml.com
\*------------------------------------------------------------------------------*/

FoamFile
{
    version     		2.0;
    format      		ascii;
    class       		dictionary;
    object      		decomposeParDict;
}
//--------------------------------------------------------------------------------

numberOfSubdomains 		2;

method          		scotch;

distributed     		no;

roots
(
);
